> Who brings the global cattle thing in?

The provider is adding `global.cattle.cluster*`, but it's taken into account to supress resource diff,  https://github.com/rancher/terraform-provider-rancher2/blob/master/rancher2/schema_app_v2.go#L94

With same config, i'm not able to reproduce your issue

```
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # rancher2_app_v2.rancher-monitoring will be created
  + resource "rancher2_app_v2" "rancher-monitoring" {
      + annotations                 = (known after apply)
      + chart_name                  = "rancher-monitoring"
      + chart_version               = "9.4.200"
      + cleanup_on_fail             = false
      + cluster_id                  = "local"
      + cluster_name                = (known after apply)
      + disable_hooks               = false
      + disable_open_api_validation = false
      + force_upgrade               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + name                        = "rancher-monitoring"
      + namespace                   = "cattle-monitoring-system"
      + repo_name                   = "rancher-charts"
      + values                      = <<~EOT
            rkeScheduler:
              enabled: true

            rkeProxy:
              enabled: true

            rkeEtcd:
              enabled: true

            alertmanager:
              alertmanagerSpec:
                useExistingSecret: true
                configSecret: alertmanager-rancher-monitoring-alertmanager
              config:
                global:
                  resolve_timeout: 5m
                receivers:
                - name: "null"
                route:
                  group_by:
                  - job
                  group_interval: 5m
                  group_wait: 30s
                  receiver: 'null'
                  repeat_interval: 12h
                  routes:
                  - match:
                      alertname: Watchdog
                    receiver: 'null'
                templates:
                  - /etc/alertmanager/config/*.tmpl

            prometheus:
              prometheusSpec:
                retention: 30d
                retentionSize: 50Gi
                requests:
                  cpu: "250m"
                  memory: "250Mi"
                storageSpec:
                  volumeClaimTemplate:
                    spec:
                      accessModes:
                      - ReadWriteOnce
                      resources:
                        requests:
                          storage: 50Gi
        EOT
      + wait                        = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

rancher2_app_v2.rancher-monitoring: Creating...
rancher2_app_v2.rancher-monitoring: Still creating... [10s elapsed]
rancher2_app_v2.rancher-monitoring: Still creating... [20s elapsed]
rancher2_app_v2.rancher-monitoring: Still creating... [30s elapsed]
rancher2_app_v2.rancher-monitoring: Creation complete after 31s [id=cattle-monitoring-system/rancher-monitoring]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
$ terraform apply
rancher2_app_v2.rancher-monitoring: Refreshing state... [id=cattle-monitoring-system/rancher-monitoring]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
```